// Функции для работы с микроконтроллером написаны за вас и лежат в SDK; чтобы ими пользоваться, их нужно объявить в своей программе
#include "pico/stdlib.h" // даёт базовые типы и функцию задержки sleep_ms
#include "hardware/gpio.h" // функции работы с выводами микроконтроллера

const uint LED_PIN = 25; // номер вывода. Светодиод на плате Raspberry Pi Pico подключён к выводу 25

int main()
{
    gpio_init(LED_PIN); // включает вывод
    gpio_set_dir(LED_PIN, GPIO_OUT); // задаёт направление. GPIO_OUT означает, что микроконтр. будет выдавать напряжение, а не считывать его.

    while (1)
    {
        gpio_put(LED_PIN, 1); // задаёт напряжение на выводе. При 1 вывод подключается к питанию микрок. который питается от 3,3 В, а значит и напряжение на выводе станет равным 3,3 В
        sleep_ms(250); 
        gpio_put(LED_PIN, 0); // вывод соединяется с GND, землёй, и напряжение на выводе 0 В.
        sleep_ms(1000); // останавливает выполнение программы на указанное число миллисекунд
    }

}

// Программа написана, но сама по себе она — текст. Чтобы получить прошивку, нужно описать сборку: 
// из каких файлов собирать, с какими библиотеками, по каким правилам размещать в памяти и в каких форматах выдать результат. 
// Это описание читает CMake из файла CMakeLists.txt.